{
  "backend/main.mo": "Main actor implementing salon booking platform with services, stylists, appointments, AI styling consultations, salon registration, user profiles, sales tracking, reviews, and business dashboard analytics. Includes authorization and blob storage mixins with migration support.",
  "backend/migration.mo": "Migration module that upgrades actor state from old schema to new schema by adding empty saleStore and reviewStore maps while preserving existing service, stylist, appointment, user profile, salon, and hairstyle photo data.",
  "feature_evidence.json": "Feature evidence report documenting implementation of salon-specific dashboard with monthly sales charts, booking charts, customer reviews display, and authentication/authorization for salon owner access control.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components, pages, and hooks including salon dashboard, booking flow, AI styling consultation, profile management, and admin features with professional management platform styling.",
  "frontend/index.css": "Global Tailwind CSS configuration with professional color palette using CSS custom properties for light and dark themes, including sidebar, chart, and component-specific design tokens.",
  "frontend/index.html": "HTML entry point for SalonHub application with SEO meta tags describing salon discovery and booking functionality.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for landing, services, stylists, booking, appointments, admin salon management, booking management, and salon owner dashboard pages.",
  "frontend/src/components/AIStylingConsultationStep.tsx": "Multi-step AI styling consultation component that handles photo upload, style description input, customization selection, and generates mock hairstyle recommendations with preview functionality.",
  "frontend/src/components/AIStylingRecommendations.tsx": "Displays AI-generated hairstyle recommendations with confidence scores, matches them to available services and stylists, and allows users to accept recommendations or skip to manual selection.",
  "frontend/src/components/BookingConfirmation.tsx": "Shows a confirmation screen after successful booking with appointment details (salon, service, stylist, date/time) and navigation buttons to view appointments or return home.",
  "frontend/src/components/BookingForm.tsx": "Multi-step booking form component that guides users through salon selection, optional AI consultation, service/stylist selection, and date/time picking to create an appointment.",
  "frontend/src/components/CTASection.tsx": "Empty component file with no content.",
  "frontend/src/components/CustomizationPreview.tsx": "Displays before/after preview images of hairstyle customizations, showing the original photo and a dynamically selected variation image based on applied customizations (color, style, etc.).",
  "frontend/src/components/CustomizationSelector.tsx": "A component that displays a list of hairstyle customization options (color, cut, texture, style) with checkboxes, allowing users to select multiple variations and reset selections.",
  "frontend/src/components/HeroSection.tsx": "The landing page hero section with a background image, headline, description, and two CTA buttons for finding nearby salons or browsing all salons.",
  "frontend/src/components/Layout.tsx": "Main application layout component with header navigation, authentication controls, role-based menu items (admin, salon owner), mobile menu, and footer with social links.",
  "frontend/src/components/LocationFilter.tsx": "Empty file with no content.",
  "frontend/src/components/MonthlyBookingsChart.tsx": "A line chart component using Recharts to visualize monthly booking statistics over the last 12 months.",
  "frontend/src/components/MonthlySalesChart.tsx": "A bar chart component using Recharts to display monthly revenue and transaction data over the last 12 months.",
  "frontend/src/components/PhotoCustomizationDisplay.tsx": "Orchestrates the photo customization workflow by displaying the original photo, customization selector, preview, and navigation buttons for applying selected hairstyle variations.",
  "frontend/src/components/PhotoUploadStep.tsx": "A drag-and-drop photo upload component with file validation (type, size limits), preview display, and error handling for hairstyle customization.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal component for initial user profile setup with form fields for name (required), phone, and email. Uses useSaveUserProfile hook to persist data and displays a welcome message with user icon.",
  "frontend/src/components/ReviewsList.tsx": "Displays a sorted list of customer reviews with star ratings, reviewer names, timestamps, and comments. Shows empty state when no reviews exist and formats timestamps as relative dates.",
  "frontend/src/components/SalonCard.tsx": "Card component displaying salon information including name, address, owner, contact details, distance, and verification badge. Includes a button to navigate to the booking page.",
  "frontend/src/components/SalonRegistrationDetailModal.tsx": "Empty file with no content.",
  "frontend/src/components/ServiceCard.tsx": "Card component displaying a service with name, description, duration in minutes, and price in dollars (converted from cents). Uses icons for duration and price display.",
  "frontend/src/components/ServicesOverview.tsx": "Homepage section showing the first 4 featured services in a grid with a \"View All Services\" button. Displays loading skeletons while fetching data.",
  "frontend/src/components/StylePreviewToggle.tsx": "Grid of selectable style preview cards showing style names, images, and confidence scores. Highlights the active selection with a ring and checkmark.",
  "frontend/src/components/StylistCard.tsx": "Card component displaying stylist profile with photo, name, specialties as tags, and bio. Shows placeholder user icon when no photo is available.",
  "frontend/src/components/StylistShowcase.tsx": "Homepage section displaying the first 3 featured stylists in a grid with a \"Meet Our Stylists\" button. Shows loading skeletons and total stylist count.",
  "frontend/src/components/TimeSlotPicker.tsx": "Grid of time slot buttons (9:00-19:00 in 30-min intervals) for appointment booking. Checks availability against existing appointments and disables unavailable slots.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state. Initializes access control with admin token and invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for fetching and mutating backend data including services, stylists, appointments, user profiles, salons, hairstyle recommendations, and business dashboards with toast notifications.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for light/dark themes using a professional blue/grey palette, plus utility classes for buttons, sections, cards, and text gradients.",
  "frontend/src/main.tsx": "Application entry point that renders the root component wrapped with QueryClientProvider for React Query and InternetIdentityProvider for authentication.",
  "frontend/src/pages/AdminSalonDashboardPage.tsx": "Admin-only page displaying all salons with filtering by status and search, showing metrics like appointment counts, stylist counts, and registration status with access control.",
  "frontend/src/pages/BookingManagementPage.tsx": "Admin-only page for viewing and filtering all appointments across salons with search, status, and salon filters, displaying appointment details in a sortable table.",
  "frontend/src/pages/BookingPage.tsx": "User-facing booking page that requires authentication, checks for user profile completion, and displays BookingForm or ProfileSetupModal accordingly.",
  "frontend/src/pages/LandingPage.tsx": "Landing page component that displays hero section, services overview, stylist showcase, and admin-only platform statistics (total salons, bookings, pending/confirmed counts) using cards and icons.",
  "frontend/src/pages/MyAppointmentsPage.tsx": "User appointments page that requires authentication, displays a list of user's appointments with status badges, date/time formatting, and allows cancellation of future appointments that aren't already canceled or completed.",
  "frontend/src/pages/SalonOwnerDashboardPage.tsx": "Dashboard for salon owners that auto-selects their first owned salon, displays salon metrics (sales, bookings, reviews), and includes monthly charts; requires authentication and salon ownership verification.",
  "frontend/src/pages/SalonRegistrationPage.tsx": "Empty file with no content.",
  "frontend/src/pages/SalonsPage.tsx": "Displays all approved salons with auto-detected user location, calculates and sorts salons by distance using geolocation API, and shows location error messages gracefully when permissions are denied.",
  "frontend/src/pages/ServicesPage.tsx": "Services listing page that fetches and displays all available services in a grid layout using ServiceCard components, with loading states and error handling.",
  "frontend/src/pages/StylistsPage.tsx": "Stylists listing page that fetches and displays all stylists in a grid layout using StylistCard components, with loading states and error handling.",
  "frontend/src/utils/matchRecommendations.ts": "Utility functions for matching AI style recommendations with available services and stylists using exact ID matching and fuzzy text matching based on keywords, specialties, and descriptions.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, typography, container queries, custom animations (accordion, fade-in), and Inter font family.",
  "project_state.json": "Project state tracking for a salon booking app with features for salon-specific dashboards, analytics graphs (sales/bookings per month), customer reviews display, and authentication/authorization for data isolation."
}